#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.frontend.random_pet.this: Refreshing state... [id=oddly-feasible-sheepdog]
module.users.null_resource.build: Refreshing state... [id=6969104150465917898]
module.users.module.api_log_group.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=videoStreamer-dev]
module.users.module.api_gateway.aws_apigatewayv2_api.this[0]: Refreshing state... [id=bkwb43pdx4]
module.users.aws_cognito_user_pool.user_pool: Refreshing state... [id=us-east-2_U0QsuLBDF]
module.frontend.module.s3_one.aws_s3_bucket.this[0]: Refreshing state... [id=video-oddly-feasible-sheepdog]
module.frontend.module.log_bucket.aws_s3_bucket.this[0]: Refreshing state... [id=logs-oddly-feasible-sheepdog]
module.frontend.aws_wafv2_web_acl.waf_acl: Refreshing state... [id=261a574a-22ff-4a2f-8a1c-6a31c43d9262]
module.users.module.api_gateway.aws_apigatewayv2_stage.default[0]: Refreshing state... [id=$default]
module.users.aws_ssm_parameter.users_pool_id: Refreshing state... [id=/videoStreamer/dev/pool_id]
module.users.aws_cognito_user_pool_client.client: Refreshing state... [id=3hvgn496jss3qf1be2bjqb6mpr]
module.users.aws_ssm_parameter.users_client_secret: Refreshing state... [id=/videoStreamer/dev/client_secret]
module.users.aws_ssm_parameter.users_client_id: Refreshing state... [id=/videoStreamer/dev/client_id]
module.users.module.lambdas["register"].aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/auth_register]
module.users.module.lambdas["confirm_register"].aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/auth_confirm_register]
module.users.module.lambdas["login"].aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/auth_login]
module.users.module.lambdas["register"].local_file.archive_plan[0]: Refreshing state... [id=4084e2eefd87fc60f78d1536c67e7a565839b3aa]
module.users.module.lambdas["confirm_register"].local_file.archive_plan[0]: Refreshing state... [id=125ff3d195dfff5cd0f509bfafe68a374632362e]
module.users.module.lambdas["login"].local_file.archive_plan[0]: Refreshing state... [id=be0856446fd4d79f890b3330215e91d7c78b0254]
module.users.module.lambdas["register"].aws_iam_role.lambda[0]: Refreshing state... [id=auth_register]
module.users.module.lambdas["confirm_register"].aws_iam_role.lambda[0]: Refreshing state... [id=auth_confirm_register]
module.users.module.lambdas["login"].aws_iam_role.lambda[0]: Refreshing state... [id=auth_login]
module.users.module.lambdas["register"].null_resource.archive[0]: Refreshing state... [id=65518385155570557]
module.frontend.module.acm.aws_acm_certificate.this[0]: Refreshing state... [id=arn:aws:acm:us-east-1:529080338478:certificate/7f7367c6-e7f4-4123-9c9c-31819121e9e8]
module.users.module.lambdas["confirm_register"].null_resource.archive[0]: Refreshing state... [id=7292827820393862033]
module.users.module.lambdas["login"].null_resource.archive[0]: Refreshing state... [id=1204715029153027790]
module.frontend.module.cdn.aws_cloudfront_origin_access_identity.this["s3_bucket_one"]: Refreshing state... [id=E14FTGNQB6ANNI]
module.frontend.module.s3_one.aws_s3_bucket_versioning.this[0]: Refreshing state... [id=video-oddly-feasible-sheepdog]
module.frontend.module.log_bucket.aws_s3_bucket_acl.this[0]: Refreshing state... [id=logs-oddly-feasible-sheepdog]
module.frontend.module.s3_one.aws_s3_bucket_acl.this[0]: Refreshing state... [id=video-oddly-feasible-sheepdog,private]
module.frontend.aws_ssm_parameter.cdn_bucket: Refreshing state... [id=/video/cdn/bucket]
module.users.module.lambdas["register"].aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::529080338478:policy/auth_register-logs]
module.users.module.lambdas["confirm_register"].aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::529080338478:policy/auth_confirm_register-logs]
module.users.module.lambdas["login"].aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::529080338478:policy/auth_login-logs]
module.frontend.module.log_bucket.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=logs-oddly-feasible-sheepdog]
module.users.module.acm.aws_acm_certificate.this[0]: Refreshing state... [id=arn:aws:acm:us-east-2:529080338478:certificate/9d043360-071c-4e63-b391-432548a5fe3c]
module.frontend.module.s3_one.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=video-oddly-feasible-sheepdog]
module.frontend.module.acm.aws_route53_record.validation[1]: Refreshing state... [id=Z0504674431EVA0LRLBF__cb0ab2c26d165a5dbd01aee00ae73bee.www.video.rayprogramming.com._CNAME]
module.frontend.module.acm.aws_route53_record.validation[0]: Refreshing state... [id=Z0504674431EVA0LRLBF__03818f016c5687757483524eb672ebaa.video.rayprogramming.com._CNAME]
module.users.module.lambdas["confirm_register"].aws_lambda_function.this[0]: Refreshing state... [id=auth_confirm_register]
module.users.module.lambdas["confirm_register"].aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=auth_confirm_register-20220426045657940800000004]
module.users.module.lambdas["register"].aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=auth_register-20220426045657892300000003]
module.users.module.lambdas["login"].aws_lambda_function.this[0]: Refreshing state... [id=auth_login]
module.users.module.lambdas["register"].aws_lambda_function.this[0]: Refreshing state... [id=auth_register]
module.users.module.lambdas["login"].aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=auth_login-20220426045657880400000002]
module.users.module.acm.aws_route53_record.validation[0]: Refreshing state... [id=Z0504674431EVA0LRLBF__d15789f6dfdbf2a94e5e29ee974e9637.auth.video.rayprogramming.com._CNAME]
module.users.module.acm.aws_acm_certificate_validation.this[0]: Refreshing state... [id=2022-04-26 04:57:03.669 +0000 UTC]
module.frontend.module.acm.aws_acm_certificate_validation.this[0]: Refreshing state... [id=2022-04-26 04:57:04.317 +0000 UTC]
module.users.module.api_gateway.aws_apigatewayv2_integration.this["POST /register"]: Refreshing state... [id=cf66wkg]
module.users.module.api_gateway.aws_apigatewayv2_integration.this["POST /confirm"]: Refreshing state... [id=xborzhg]
module.users.module.api_gateway.aws_apigatewayv2_domain_name.this[0]: Refreshing state... [id=auth.video.rayprogramming.com]
module.users.module.api_gateway.aws_apigatewayv2_route.this["POST /register"]: Refreshing state... [id=78zff44]
module.users.module.api_gateway.aws_apigatewayv2_route.this["POST /confirm"]: Refreshing state... [id=7zmmhb6]
module.frontend.module.cdn.aws_cloudfront_distribution.this[0]: Refreshing state... [id=E2DOLLEMQEN77H]
module.users.module.api_gateway.aws_apigatewayv2_api_mapping.this[0]: Refreshing state... [id=snhq0r]
module.frontend.module.cdn.aws_cloudfront_monitoring_subscription.this[0]: Refreshing state... [id=E2DOLLEMQEN77H]
module.frontend.module.records.aws_route53_record.this["video.rayprogramming.com A"]: Refreshing state... [id=Z0504674431EVA0LRLBF_video.rayprogramming.com.video.rayprogramming.com_A]
module.frontend.module.records.aws_route53_record.this["www.video.rayprogramming.com A"]: Refreshing state... [id=Z0504674431EVA0LRLBF_www.video.rayprogramming.com.video.rayprogramming.com_A]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.frontend.module.acm.aws_acm_certificate.this[0] has changed
  ~ resource "aws_acm_certificate" "this" {
        id                        = "arn:aws:acm:us-east-1:529080338478:certificate/7f7367c6-e7f4-4123-9c9c-31819121e9e8"
      ~ subject_alternative_names = [
          + "video.rayprogramming.com",
            # (1 unchanged element hidden)
        ]
        tags                      = {}
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.frontend.module.cdn.aws_cloudfront_distribution.this[0] has changed
  ~ resource "aws_cloudfront_distribution" "this" {
        id                             = "E2DOLLEMQEN77H"
      ~ status                         = "InProgress" -> "Deployed"
      + tags                           = {}
        # (19 unchanged attributes hidden)





        # (5 unchanged blocks hidden)
    }

  # module.frontend.module.records.aws_route53_record.this["video.rayprogramming.com A"] has changed
  ~ resource "aws_route53_record" "this" {
        id      = "Z0504674431EVA0LRLBF_video.rayprogramming.com.video.rayprogramming.com_A"
        name    = "video.rayprogramming.com.video.rayprogramming.com"
      + records = []
      + ttl     = 0
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.frontend.module.records.aws_route53_record.this["www.video.rayprogramming.com A"] has changed
  ~ resource "aws_route53_record" "this" {
        id      = "Z0504674431EVA0LRLBF_www.video.rayprogramming.com.video.rayprogramming.com_A"
        name    = "www.video.rayprogramming.com.video.rayprogramming.com"
      + records = []
      + ttl     = 0
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.users.module.acm.aws_acm_certificate.this[0] has changed
  ~ resource "aws_acm_certificate" "this" {
        id                        = "arn:aws:acm:us-east-2:529080338478:certificate/9d043360-071c-4e63-b391-432548a5fe3c"
      ~ subject_alternative_names = [
          + "auth.video.rayprogramming.com",
        ]
        tags                      = {
            "Env"  = "dev"
            "Name" = "auth.video.rayprogramming.com"
        }
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.users.module.lambdas["confirm_register"].local_file.archive_plan[0] has been deleted
  - resource "local_file" "archive_plan" {
      - content              = jsonencode(
            {
              - artifacts_dir = "builds"
              - build_plan    = [
                  - [
                      - "zip",
                      - ".terraform/modules/users/functions/dist/confirmRegistration.js",
                      - null,
                    ],
                ]
              - filename      = "builds/fc74a0d6828436ccb95729d5b6c752da2989b6fd3ba5eeed7e6cfe921c8fef59.zip"
              - runtime       = "nodejs14.x"
            }
        ) -> null
      - directory_permission = "0755" -> null
      - file_permission      = "0644" -> null
      - filename             = "builds/fc74a0d6828436ccb95729d5b6c752da2989b6fd3ba5eeed7e6cfe921c8fef59.plan.json" -> null
      - id                   = "125ff3d195dfff5cd0f509bfafe68a374632362e" -> null
    }

  # module.users.module.lambdas["login"].local_file.archive_plan[0] has been deleted
  - resource "local_file" "archive_plan" {
      - content              = jsonencode(
            {
              - artifacts_dir = "builds"
              - build_plan    = [
                  - [
                      - "zip",
                      - ".terraform/modules/users/functions/dist/login.js",
                      - null,
                    ],
                ]
              - filename      = "builds/9a2d50fc3eeb8cd49cd45f12c0b365015307ca19c28520c04b8ae5dfed4dfade.zip"
              - runtime       = "nodejs14.x"
            }
        ) -> null
      - directory_permission = "0755" -> null
      - file_permission      = "0644" -> null
      - filename             = "builds/9a2d50fc3eeb8cd49cd45f12c0b365015307ca19c28520c04b8ae5dfed4dfade.plan.json" -> null
      - id                   = "be0856446fd4d79f890b3330215e91d7c78b0254" -> null
    }

  # module.users.module.lambdas["register"].local_file.archive_plan[0] has been deleted
  - resource "local_file" "archive_plan" {
      - content              = jsonencode(
            {
              - artifacts_dir = "builds"
              - build_plan    = [
                  - [
                      - "zip",
                      - ".terraform/modules/users/functions/dist/register.js",
                      - null,
                    ],
                ]
              - filename      = "builds/2ffe1804e754507010a0abc39d9e3e34a9f7a3f8dd23dab37b07e200366307c0.zip"
              - runtime       = "nodejs14.x"
            }
        ) -> null
      - directory_permission = "0755" -> null
      - file_permission      = "0644" -> null
      - filename             = "builds/2ffe1804e754507010a0abc39d9e3e34a9f7a3f8dd23dab37b07e200366307c0.plan.json" -> null
      - id                   = "4084e2eefd87fc60f78d1536c67e7a565839b3aa" -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.users.null_resource.build must be replaced
+/- resource "null_resource" "build" {
      ~ id       = "6969104150465917898" -> (known after apply)
      ~ triggers = {
          - "always" = "2022-04-26T05:47:44Z"
        } -> (known after apply) # forces replacement
    }

  # module.users.module.lambdas["confirm_register"].data.aws_iam_policy_document.assume_role[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role"  {
      ~ id      = "3693445097" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          - resources     = [] -> null
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.users.module.lambdas["confirm_register"].data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs"  {
      ~ id      = "2777561895" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:us-east-2:529080338478:log-group:/aws/lambda/auth_confirm_register:*:*",
                          - "arn:aws:logs:us-east-2:529080338478:log-group:/aws/lambda/auth_confirm_register:*",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # module.users.module.lambdas["confirm_register"].data.aws_partition.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_partition" "current"  {
      ~ dns_suffix         = "amazonaws.com" -> (known after apply)
      ~ id                 = "aws" -> (known after apply)
      ~ partition          = "aws" -> (known after apply)
      ~ reverse_dns_prefix = "com.amazonaws" -> (known after apply)
    }

  # module.users.module.lambdas["confirm_register"].data.external.archive_prepare[0] will be read during apply
  # (config refers to values not yet known)
 <= data "external" "archive_prepare"  {
      ~ id      = "-" -> (known after apply)
      ~ query   = {
          + "docker"                   = null
          ~ "paths"                    = jsonencode(
              ~ {
                  ~ cwd    = "/home/james/Code/github/rihoj/videoStreamer/infrastructure" -> "/home/runner/work/videoStreamer/videoStreamer/infrastructure"
                    # (2 unchanged elements hidden)
                }
            )
            # (6 unchanged elements hidden)
        }
      ~ result  = {
          - "build_plan"          = jsonencode(
                {
                  - artifacts_dir = "builds"
                  - build_plan    = [
                      - [
                          - "zip",
                          - ".terraform/modules/users/functions/dist/confirmRegistration.js",
                          - null,
                        ],
                    ]
                  - filename      = "builds/fc74a0d6828436ccb95729d5b6c752da2989b6fd3ba5eeed7e6cfe921c8fef59.zip"
                  - runtime       = "nodejs14.x"
                }
            )
          - "build_plan_filename" = "builds/fc74a0d6828436ccb95729d5b6c752da2989b6fd3ba5eeed7e6cfe921c8fef59.plan.json"
          - "filename"            = "builds/fc74a0d6828436ccb95729d5b6c752da2989b6fd3ba5eeed7e6cfe921c8fef59.zip"
          - "timestamp"           = "1650949016965895800"
          - "was_missing"         = "false"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.users.module.lambdas["confirm_register"].aws_iam_policy.logs[0] will be updated in-place
  ~ resource "aws_iam_policy" "logs" {
        id        = "arn:aws:iam::529080338478:policy/auth_confirm_register-logs"
        name      = "auth_confirm_register-logs"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:us-east-2:529080338478:log-group:/aws/lambda/auth_confirm_register:*:*",
                          - "arn:aws:logs:us-east-2:529080338478:log-group:/aws/lambda/auth_confirm_register:*",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {
            "Name" = "videoStreamer-dev"
        }
        # (4 unchanged attributes hidden)
    }

  # module.users.module.lambdas["confirm_register"].aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "auth_confirm_register"
        name                  = "auth_confirm_register"
        tags                  = {
            "Name" = "videoStreamer-dev"
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.users.module.lambdas["confirm_register"].aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/fc74a0d6828436ccb95729d5b6c752da2989b6fd3ba5eeed7e6cfe921c8fef59.zip" -> (known after apply)
        id                             = "auth_confirm_register"
      ~ last_modified                  = "2022-04-26T04:57:19.853+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-2:529080338478:function:auth_confirm_register:5" -> (known after apply)
      ~ source_code_hash               = "WglnOcN7OGtBgztzG7dXkMtZPqYEuSPKC9TNFkW3J7M=" -> (known after apply)
        tags                           = {
            "Name" = "videoStreamer-dev"
        }
      ~ version                        = "5" -> (known after apply)
        # (21 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.users.module.lambdas["confirm_register"].local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = (known after apply)
      + id                   = (known after apply)
    }

  # module.users.module.lambdas["confirm_register"].null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7292827820393862033" -> (known after apply)
      ~ triggers = {
          - "filename"  = "builds/fc74a0d6828436ccb95729d5b6c752da2989b6fd3ba5eeed7e6cfe921c8fef59.zip"
          - "timestamp" = "1650949016965895800"
        } -> (known after apply) # forces replacement
    }

  # module.users.module.lambdas["login"].data.aws_iam_policy_document.assume_role[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role"  {
      ~ id      = "3693445097" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          - resources     = [] -> null
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.users.module.lambdas["login"].data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs"  {
      ~ id      = "3321659073" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:us-east-2:529080338478:log-group:/aws/lambda/auth_login:*:*",
                          - "arn:aws:logs:us-east-2:529080338478:log-group:/aws/lambda/auth_login:*",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # module.users.module.lambdas["login"].data.aws_partition.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_partition" "current"  {
      ~ dns_suffix         = "amazonaws.com" -> (known after apply)
      ~ id                 = "aws" -> (known after apply)
      ~ partition          = "aws" -> (known after apply)
      ~ reverse_dns_prefix = "com.amazonaws" -> (known after apply)
    }

  # module.users.module.lambdas["login"].data.external.archive_prepare[0] will be read during apply
  # (config refers to values not yet known)
 <= data "external" "archive_prepare"  {
      ~ id      = "-" -> (known after apply)
      ~ query   = {
          + "docker"                   = null
          ~ "paths"                    = jsonencode(
              ~ {
                  ~ cwd    = "/home/james/Code/github/rihoj/videoStreamer/infrastructure" -> "/home/runner/work/videoStreamer/videoStreamer/infrastructure"
                    # (2 unchanged elements hidden)
                }
            )
            # (6 unchanged elements hidden)
        }
      ~ result  = {
          - "build_plan"          = jsonencode(
                {
                  - artifacts_dir = "builds"
                  - build_plan    = [
                      - [
                          - "zip",
                          - ".terraform/modules/users/functions/dist/login.js",
                          - null,
                        ],
                    ]
                  - filename      = "builds/9a2d50fc3eeb8cd49cd45f12c0b365015307ca19c28520c04b8ae5dfed4dfade.zip"
                  - runtime       = "nodejs14.x"
                }
            )
          - "build_plan_filename" = "builds/9a2d50fc3eeb8cd49cd45f12c0b365015307ca19c28520c04b8ae5dfed4dfade.plan.json"
          - "filename"            = "builds/9a2d50fc3eeb8cd49cd45f12c0b365015307ca19c28520c04b8ae5dfed4dfade.zip"
          - "timestamp"           = "1650949016966336000"
          - "was_missing"         = "false"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.users.module.lambdas["login"].aws_iam_policy.logs[0] will be updated in-place
  ~ resource "aws_iam_policy" "logs" {
        id        = "arn:aws:iam::529080338478:policy/auth_login-logs"
        name      = "auth_login-logs"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:us-east-2:529080338478:log-group:/aws/lambda/auth_login:*:*",
                          - "arn:aws:logs:us-east-2:529080338478:log-group:/aws/lambda/auth_login:*",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {
            "Name" = "videoStreamer-dev"
        }
        # (4 unchanged attributes hidden)
    }

  # module.users.module.lambdas["login"].aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "auth_login"
        name                  = "auth_login"
        tags                  = {
            "Name" = "videoStreamer-dev"
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.users.module.lambdas["login"].aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/9a2d50fc3eeb8cd49cd45f12c0b365015307ca19c28520c04b8ae5dfed4dfade.zip" -> (known after apply)
        id                             = "auth_login"
      ~ last_modified                  = "2022-04-26T04:57:07.874+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-2:529080338478:function:auth_login:1" -> (known after apply)
      ~ source_code_hash               = "MbwZRa7YpzAmLeZ8PDLNS+ZgjwlvFex6i+GMjxzOrdE=" -> (known after apply)
        tags                           = {
            "Name" = "videoStreamer-dev"
        }
      ~ version                        = "1" -> (known after apply)
        # (21 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.users.module.lambdas["login"].local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = (known after apply)
      + id                   = (known after apply)
    }

  # module.users.module.lambdas["login"].null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1204715029153027790" -> (known after apply)
      ~ triggers = {
          - "filename"  = "builds/9a2d50fc3eeb8cd49cd45f12c0b365015307ca19c28520c04b8ae5dfed4dfade.zip"
          - "timestamp" = "1650949016966336000"
        } -> (known after apply) # forces replacement
    }

  # module.users.module.lambdas["register"].data.aws_iam_policy_document.assume_role[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role"  {
      ~ id      = "3693445097" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          - resources     = [] -> null
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.users.module.lambdas["register"].data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs"  {
      ~ id      = "4227650822" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:us-east-2:529080338478:log-group:/aws/lambda/auth_register:*:*",
                          - "arn:aws:logs:us-east-2:529080338478:log-group:/aws/lambda/auth_register:*",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # module.users.module.lambdas["register"].data.aws_partition.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_partition" "current"  {
      ~ dns_suffix         = "amazonaws.com" -> (known after apply)
      ~ id                 = "aws" -> (known after apply)
      ~ partition          = "aws" -> (known after apply)
      ~ reverse_dns_prefix = "com.amazonaws" -> (known after apply)
    }

  # module.users.module.lambdas["register"].data.external.archive_prepare[0] will be read during apply
  # (config refers to values not yet known)
 <= data "external" "archive_prepare"  {
      ~ id      = "-" -> (known after apply)
      ~ query   = {
          + "docker"                   = null
          ~ "paths"                    = jsonencode(
              ~ {
                  ~ cwd    = "/home/james/Code/github/rihoj/videoStreamer/infrastructure" -> "/home/runner/work/videoStreamer/videoStreamer/infrastructure"
                    # (2 unchanged elements hidden)
                }
            )
            # (6 unchanged elements hidden)
        }
      ~ result  = {
          - "build_plan"          = jsonencode(
                {
                  - artifacts_dir = "builds"
                  - build_plan    = [
                      - [
                          - "zip",
                          - ".terraform/modules/users/functions/dist/register.js",
                          - null,
                        ],
                    ]
                  - filename      = "builds/2ffe1804e754507010a0abc39d9e3e34a9f7a3f8dd23dab37b07e200366307c0.zip"
                  - runtime       = "nodejs14.x"
                }
            )
          - "build_plan_filename" = "builds/2ffe1804e754507010a0abc39d9e3e34a9f7a3f8dd23dab37b07e200366307c0.plan.json"
          - "filename"            = "builds/2ffe1804e754507010a0abc39d9e3e34a9f7a3f8dd23dab37b07e200366307c0.zip"
          - "timestamp"           = "1650949016974551000"
          - "was_missing"         = "false"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.users.module.lambdas["register"].aws_iam_policy.logs[0] will be updated in-place
  ~ resource "aws_iam_policy" "logs" {
        id        = "arn:aws:iam::529080338478:policy/auth_register-logs"
        name      = "auth_register-logs"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:us-east-2:529080338478:log-group:/aws/lambda/auth_register:*:*",
                          - "arn:aws:logs:us-east-2:529080338478:log-group:/aws/lambda/auth_register:*",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {
            "Name" = "videoStreamer-dev"
        }
        # (4 unchanged attributes hidden)
    }

  # module.users.module.lambdas["register"].aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "auth_register"
        name                  = "auth_register"
        tags                  = {
            "Name" = "videoStreamer-dev"
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.users.module.lambdas["register"].aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/2ffe1804e754507010a0abc39d9e3e34a9f7a3f8dd23dab37b07e200366307c0.zip" -> (known after apply)
        id                             = "auth_register"
      ~ last_modified                  = "2022-04-26T04:57:13.866+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-2:529080338478:function:auth_register:5" -> (known after apply)
      ~ source_code_hash               = "m//yvL9I8WVlUSN6lki46Wh9L193w9/9RyMfrp1kk74=" -> (known after apply)
        tags                           = {
            "Name" = "videoStreamer-dev"
        }
      ~ version                        = "5" -> (known after apply)
        # (21 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.users.module.lambdas["register"].local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = (known after apply)
      + id                   = (known after apply)
    }

  # module.users.module.lambdas["register"].null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "65518385155570557" -> (known after apply)
      ~ triggers = {
          - "filename"  = "builds/2ffe1804e754507010a0abc39d9e3e34a9f7a3f8dd23dab37b07e200366307c0.zip"
          - "timestamp" = "1650949016974551000"
        } -> (known after apply) # forces replacement
    }

Plan: 7 to add, 9 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @Rihoj, Action: `pull_request`, Working Directory: ``, Workflow: `Plan`*